# St7SetEnvelopeAdditionalBeamSlices

Sets the option to automatically insert slices to capture maxima and other points of interest in beam force and
moment envelopes.

long St7SetEnvelopeAdditionalBeamSlices(long uID, bool Additional)
Input Parameters
uID
Strand7 model file ID.
Additional
True to add additional slices.